app/controllers/api/products_controller.rb

    def index
        @products = Product.with_attached_photos.all
---
SELECT "products".* FROM "products"

    def show
        # debugger
        @product = Product.with_attached_photos.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]